Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །དེ་ལ་བྱ་བ་ལ་འཇུག་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is engagement in activity?

source: བརྩོན་འགྲུས་ལས་བྱུང་བའི་སྡུག་བསྔལ་ཆུད་མི་ཟ་བའོ།
en: It is not giving up because of suffering arising from diligence.

source: །དེ་ལ་རྒྱུ་བསྟན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the illumination of causes?

source: ཕུང་པོ་བྲག་ཅ་ལྟ་བུར་མངོན་པར་སྒྲུབ་པའོ།
en: It is perceiving that the skandhas are like echoes.

source: །དེ་ལ་འབྲས་བུ་ཆུད་མི་ཟ་བ་གང་ཞེ་ན།
en: “What is the non-dissipation of the results of karma?

source: འདི་ལྟ་སྟེ། ལས་ཀྱི་འབྲས་བུ་རྨི་ལམ་ལྟ་བུར་ཆུད་མི་ཟ་བའོ།
en: It is knowing that the results of karma do not dissipate like a dream.

source: །དེ་ལ་ཆོས་མཐོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is insight into phenomena?

source: ཆོས་ཐམས་ཅད་མི་མཐོང་བའོ།
en: It is not seeing phenomena.

source: །དེ་ལ་ལམ་བསྒོམ་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the meditation of the path?

source: ཆོས་ཐམས་ཅད་མི་དམིགས་པར་སྒོམ་པའོ།
en: It is meditation on the nonperception of all phenomena.

source: །དེ་ལ་དེ་བཞིན་གཤེགས་པ་དང་ཕྲད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is meeting the tathāgatas?

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བསླབ་པ་སྒྲུབ་པའོ།
en: It is practicing the training of all the buddhas.

source: །དེ་ལ་ཤེས་རབ་རྣོ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is sharp wisdom?

source: ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པར་བཟོད་པའོ།
en: It is the patience of the birthlessness of phenomena.

source: །དེ་ལ་སེམས་ཅན་གྱི་རྗེས་སུ་འཇུག་པ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པའི་ཡེ་ཤེས་སོ།
en: “What is penetrating into beings? It is knowing the higher and the lower faculties.

source: །དེ་ལ་ཆོས་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is knowledge of phenomena?

source: །དེ་ལ་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་འཇུག་པ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the knowledge of engaging in discernment?

source: ཆོས་ཀྱི་ཚུལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོག་པའོ།
en: It is engaging in the true nature of phenomena.

source: །དེ་ལ་ཡི་གེ་རབ་ཏུ་དབྱེ་བ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the knowledge of the different kinds of letters and words?

source: གསང་སྔགས་གསུམ་སྦྱོར་བར་ཤེས་པ་དང་། རྣམ་པ་དང་རྣམ་པ་མ་ཡིན་པ་ཤེས་པའོ།
en: It is the knowledge of engaging with the three mantras, and knowing what is the form and what is not the form of words.

source: །དེ་ལ་དངོས་པོ་ལས་ཡང་དག་པར་འདའ་བ་ཤེས་པ་གང་ཞེ་ན།
en: “What is the transcendence of matter?

source: འདི་ལྟ་སྟེ། དངོས་པོ་མེད་པར་རྟོགས་པའོ།
en: It is the understanding of immateriality.

source: །དེ་ལ་དབྱངས་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བྲག་ཅ་ལྟ་བུར་ཤེས་པའོ།
en: “What is the understanding of sounds? It is knowing them to be like echoes. Young man, that is the understanding of sounds.

source: །དེ་ལ་མཆོག་ཏུ་དགའ་བ་འཐོབ་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the attainment of joy?

source: ཆོས་ཐམས་ཅད་མི་དམིགས་ཤིང་། འབྱུང་བ་དང་སྡུག་བསྔལ་སྤངས་པ་དང་། ཁུར་བོར་བའོ།
en: It is the nonperception of all phenomena, the ending of the suffering that arises from saṃsāra, and putting down one’s burden.

source: །དེ་ལ་ཆོས་ཀྱི་དགའ་བ་མྱོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is experiencing the joy of the Dharma?

source: གདམས་པར་བྱ་བ་དང་། མགུ་བར་བྱ་བ་མི་གཏོང་བ་དང་། རང་གི་ཐེག་པའི་ལེགས་པ་མཐོང་བའོ།
en: It is never abandoning teaching, pleasing, and seeing the excellence of one’s yāna.

source: །དེ་ལ་གནས་པ་པོ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is abiding?

source: འཕགས་པའི་བདེན་པ་རྟོགས་པའོ།
en: It is the realization of the truths of the noble ones.

source: །དེ་ལ་དྲང་པོ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is sincerity?

source: སྤྱོད་ལམ་བཅོས་པ་མེད་པའོ།
en: It is uncontrived conduct.

source: །དེ་ལ་བཞིན་ཁྲོ་གཉེར་མེད་པ་གང་ཞེ་ན།
en: “What is no longer having frowns?

source: འདི་ལྟ་སྟེ། ཞེ་སྡང་མེད་པའོ།
en: It is being without anger.

source: །དེ་ལ་དགེ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འགྲོགས་ན་བདེ་བའོ།
en: “What is being pleasant? It is being good company.

source: །དེ་ལ་མཉེན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཕ་རོལ་ལ་ཕན་པའི་དངོས་པོའོ།
en: “What is being gentle? It is being beneficial to others.

source: །དེ་ལ་གསོང་པོར་སྨྲ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཚུར་ཤོག་ལེགས་པར་འོངས་སོ།
en: “What is being courteous?

source: །ཞེས་བྱས་པ་དང་མྱུར་དུ་ལྡང་བའོ།
en: It is being welcoming and standing up quickly.

source: །དེ་ལ་བླ་མ་ལ་གུས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is having veneration for the guru?

source: བླ་མ་ལ་འཇིགས་ཤིང་དགེ་བའི་བཤེས་གཉེན་དུ་འདུ་ཤེས་པའོ།
en: It is being fearful of the guru and perceiving the guru as the kalyāṇamitra.

source: །དེ་ལ་བླ་མ་ལ་སྲི་ཞུ་བྱེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is respect for the guru?

source: བླ་མ་ལ་རིམ་གྲོ་དང་གཡོག་བྱ་བའོ།
en: It is honoring and serving the guru.

source: །དེ་ལ་སྐྱེ་བས་ཆོག་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is being content with occurences?

source: སྐྱེ་བ་ཐམས་ཅད་ལ་ཆགས་པ་མེད་པའོ།
en: It is having no attachment to anything that occurs.

source: །དེ་ལ་དཀར་པོའི་ཆོས་ཀྱིས་མི་ངོམས་པ་གང་ཞེ་ན།
en: “What is never being satisfied with the good actions one has done?

source: འདི་ལྟ་སྟེ། དཀར་པོའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་ཚོལ་ཞིང་དགེ་བ་གང་ཡིན་ཞེས་ཚོལ་བའོ།
en: It is pursuing every kind of good action and seeking for any good action.

source: །དེ་ལ་འཚོ་བ་ཡོངས་སུ་དག་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is having a pure livelihood?

source: ངན་ངོན་གྱིས་ཆོག་ཤེས་པ་དང་། ཚུལ་འཆོས་པ་མེད་པ་དང་། ཁ་གསག་མེད་པ་དང་། ཐོབ་ཀྱིས་འཇལ་བ་མེད་པ་དང་། རྙེད་པས་རྙེད་པ་ལ་འདོད་པ་མེད་པའོ།
en: It is being satisfied with anything, using no trickery, no flattery, not being covetous, and not having the desire to acquire.

source: །དེ་ལ་དགོན་པར་གནས་པ་མི་གཏོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is not forsaking the solitary life? It is not abandoning dedication to good actions and delighting in residing in a remote place;

source: དགེ་བའི་ཆོས་རྣམས་ལ་བརྩོན་པ་མི་འདོར་ཞིང་བས་མཐའི་གནས་མལ་ལ་མངོན་པར་དགའ་བ་དང་། ནགས་སྟུག་པོ་དང་། གཅོང་རོང་དང་། ཕུག་དང་སྨན་ཤོང་དུ་མངོན་པར་དགའ་བ་དང་། ཆོས་ཀྱི་དགའ་བ་མྱོང་བར་བྱེད་པ་དང་། ཁྱིམ་པ་དང་རབ་ཏུ་བྱུང་བ་རྣམས་དང་མི་འདྲི་བ་དང་། རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ལ་མ་ཆགས་པ་དང་། སྲེད་པ་སྤོང་བ་དང་། བསམ་གཏན་གྱི་དགའ་བ་མྱོང་བ་སྟེ།
en: delighting in dense forests, inaccessible mountain sites, and the interior of caves; experiencing the joy of the Dharma; not mixing laypeople and renunciants; not having attachment to gain, honors, or praise; rejecting craving; and experiencing the joy of dhyāna.

source: འདི་ནི་དགོན་པ་ལ་གནས་པ་མི་གཏོང་བ་ཞེས་བྱའོ།
en: That is not forsaking the solitary life.

source: །དེ་ལ་ས་ལ་གནས་པ་ཤེས་པ་གང་ཞེ་ན།
en: “What is the knowledge of successive levels?

source: འདི་ལྟ་སྟེ། ཉན་ཐོས་ཀྱི་འབྲས་བུ་རྣམ་པར་གཞག་པ་ཤེས་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ས་རྣམ་པར་གཞག་པ་ཤེས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་རྣམ་པར་གཞག་པ་ཤེས་པའོ།
en: It is the knowledge of the distinctive result of the śrāvaka, knowledge of the distinctive level of the pratyekabuddha, and knowledge of the distinctive level of the bodhisattva.

source: །དེ་ལ་དྲན་པ་མི་ཉམས་པ་གང་ཞེ་ན།
en: “What is always maintaining mindfulness?

source: འདི་ལྟ་སྟེ། མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པར་ཡིད་ལ་བྱེད་པའོ།
en: It is being attentive to impermanence, suffering, emptiness, and the absence of self.

source: །དེ་ལ་ཕུང་པོ་ལ་མཁས་པའི་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is being wise concerning the skandhas, wise concerning the dhātus, and wise concerning the āyatanas?

source: ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་རབ་ཏུ་དབྱེ་བ་ཡང་ཤེས་ཤིང་དེ་ལ་མི་དམིགས་པའོ།
en: It is having the knowledge of the categories of the skandhas, dhātus, and āyatanas, but having no perception of them.

source: །དེ་ལ་མངོན་པར་ཤེས་པ་མངོན་སུམ་དུ་བྱེད་པ་གང་ཞེ་ན།
en: “What is making one’s higher cognitions manifest to others?

source: འདི་ལྟ་སྟེ། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་ཐོབ་པ་དང་། རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པའོ།
en: It is attaining the four bases of miraculous powers and manifesting miracles.

source: །དེ་ལ་ཉོན་མོངས་པ་སེལ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the elimination of kleśas?

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྤོང་བའོ།
en: It is the elimination of desire, anger, and ignorance.

source: །དེ་ལ་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ལེགས་པར་འཇོམས་པ་ཤེས་པ་གང་ཞེ་ན།
en: “What is ceasing engagement with propensities?

source: འདི་ལྟ་སྟེ། སྔོན་གྱི་བྱིས་པའི་སྤྱོད་པ་ལ་སྨད་པ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་མི་འདོད་པའོ།
en: It is reviling previous foolish conduct and not wishing for the level of the śrāvakas or pratyekabuddhas.

source: །དེ་ལ་ཁྱད་པར་དུ་འགྲོ་བ་གང་ཞེ་ན།
en: “What is having specific attainments?

source: འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་སྒྲུབ་པའོ།
en: It is accomplishing a buddha’s strengths, fearlessnesses, and discernments.

source: །དེ་ལ་སྒོམ་པའི་རྒྱུ་འཐུན་པ་གང་ཞེ་ན།
en: “What is the natural result of meditation?

source: འདི་ལྟ་སྟེ། རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤངས་པའོ།
en: It is the elimination of attachment and aversion.

source: །དེ་ལ་ལྟུང་བ་ལས་འབྱིན་པ་ལ་མཁས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is skillfulness in eliminating transgressions?

source: སོ་སོར་ཐར་པ་དང་། འདུལ་བ་སྡོམ་པའོ།
en: It is the restraint of the prātimokṣa and the vinaya.

source: །དེ་ལ་ཡོངས་སུ་དཀྲིས་པ་གནོན་པ་གང་ཞེ་ན།
en: “What is the prevention of the arising of bad actions?

source: འདི་ལྟ་སྟེ། ཉེས་པ་བཤགས་པ་དང་། ཕྱིས་སྡོམ་པའི་ལས་དགེ་བའོ།
en: It is confessing bad actions and the virtue of restraining from them in the future.

source: །དེ་ལ་རྗེས་སུ་ཆགས་པ་སྤོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the elimination of attachment?

source: ཁམས་གསུམ་གྱི་སྲེད་པའི་འཁྲི་ཤིང་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པ་དང་། དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པ་དང་། དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་ཆུད་མི་ཟ་བར་བྱའོ།
en: It is destroying all the creepers of craving for the three existences, developing the good qualities that have not yet been developed, and not losing the good qualities that have been developed.

source: །དེ་ལ་སྲིད་པ་ལས་ཡང་དག་པར་འདའ་བ་གང་ཞེ་ན།
en: “What is transcending the existences?

source: འདི་ལྟ་སྟེ། ཁམས་གསུམ་ལ་མི་དམིགས་ཤིང་ཡིད་ལ་མི་བྱེད་པའོ།
en: It is not focusing the mind upon or engaging the mind with the three realms.

source: །དེ་ལ་སྐྱེ་བ་དྲན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྔོན་གྱི་གནས་ཤེས་པའོ།
en: “What is the memory of previous rebirths? It is the knowledge of previous lifetimes.

source: །དེ་ལ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ནེམ་ནུར་མེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is being free of doubt concerning the ripening of karma?

source: ཆད་པ་དང་རྟག་པ་རྣམ་པར་སྤོང་བའོ།
en: It is rejecting eternalism and nihilism.

source: །དེ་ལ་ཆོས་སེམས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་པའོ།
en: “What is the contemplation of phenomena? It is correct contemplation.

source: །དེ་ལ་ཐོས་པ་ཡོངས་སུ་ཚོལ་བ་གང་ཞེ་ན།
en: “What is seeking to hear the Dharma?

source: འདི་ལྟ་སྟེ། ཉན་ཐོས་ཀྱི་སྡེ་སྣོད་དང་། རང་སངས་རྒྱས་ཀྱི་སྡེ་སྣོད་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀུན་འཛིན་ཅིང་སྒོམ་པའོ།
en: It is possessing and meditating upon the piṭaka of the śrāvakas, the piṭaka of the pratyekabuddhas, and the piṭaka of the bodhisattvas.

source: །དེ་ལ་ཡེ་ཤེས་རྣོ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is having sharp knowledge?

source: རྨི་ལམ་ལྟ་བུར་མ་སྐྱེས་པ་ཤེས་པའོ།
en: It is knowing the nonorigination of phenomena to be like a dream.

source: །དེ་ལ་ཡེ་ཤེས་ལ་སྲེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is craving for wisdom?

source: ཡེ་ཤེས་ཡོངས་སུ་ཚོལ་བའོ།
en: It is seeking wisdom.

source: །དེ་ལ་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the realization of wisdom?

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་སྒྲུབ་པའོ།
en: It is the attainment of the highest, complete enlightenment.

source: །དེ་ལ་ཅང་ཤེས་ཀྱི་ས་གང་ཞེ་ན།
en: “What is the level of a noble being?

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པའི་གནས་སོ།
en: It is the state of bodhisattva training.

source: །དེ་ལ་རི་ལྟ་བུའི་སེམས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is having a mind like a mountain?

source: བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་བའོ།
en: It is not abandoning the aspiration to enlightenment.

source: །དེ་ལ་མི་གཡོ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is being unshakable?

source: ཉོན་མོངས་པ་དག་གིས་མི་འཕྲོགས་པའོ།
en: It is not being led astray by the kleśas.

source: །དེ་ལ་མི་སྒུལ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is being immovable?

source: མཚན་མ་ཐམས་ཅད་ཡིད་ལ་མི་བྱེད་པའོ།
en: It is the mind not being engaged with any attribute.

source: །དེ་ལ་ཕྱིར་མི་ལྡོག་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་མི་འཇིག་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་གཞན་ན་བཞུགས་པའི་སངས་རྒྱས་རྣམས་རྒྱུན་མི་འཆད་པར་མཐོང་བའོ།
en: “What is irreversibility? It is the unimpaired six perfections, and the continuous vision of the buddhas who reside in other worlds.

source: །དེ་ལ་དགེ་བའི་ཆོས་ཕུན་སུམ་ཚོགས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཉེ་བར་གྱུར་པའོ།
en: “What is the natural result of good qualities? It is being near to the highest, complete enlightenment.

source: །དེ་ལ་སྡིག་པའི་ལས་ལ་སྨོད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the abhorrence of bad qualities?

source: སྡོམ་པ་དང་སྡིག་པ་རྣམས་གཟོད་མ་ནས་མ་སྐྱེས་པའོ།
en: It is restraint and not performing bad actions in the first place.

source: །དེ་ལ་ཉོན་མོངས་པ་མི་འབྱུང་བ་གང་ཞེ་ན།
en: “What is being free of behavior caused by the kleśas?

source: འདི་ལྟ་སྟེ། མ་རིག་པ་དང་། སྲིད་པའི་སྲེད་པ་དང་། ཁྲོ་བ་མི་སྐྱེད་པའོ།
en: It is being free of that which is caused by ignorance, craving for existence, and anger.

source: །དེ་ལ་བསླབ་པ་ཡོངས་སུ་མི་གཏོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is never abandoning the training?

source: ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡིད་ཆེས་པ་དང་། སངས་རྒྱས་ལ་རི་མོར་བྱེད་པའོ།
en: It is conviction in the ripening of karma, and having veneration for the buddhas.

source: །དེ་ལ་ཏིང་ངེ་འཛིན་རྣམ་པར་གཞག་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is being established in samādhi?

source: སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་སྐྱེ་བ་དང་། འཇིག་པ་མེད་པ་ལ་མཁས་པ་དང་། སེམས་རྩེ་གཅིག་པའོ།
en: It is a one-pointed mind that is skilled in the nonproduction and nonperishing of the phenomena of the mind and mental events.

source: །དེ་ལ་སེམས་ཅན་གྱི་བསམ་པ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the knowledge of the thoughts of beings?

source: དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པའི་ཡེ་ཤེས་སོ།
en: It is the wisdom that knows the superior and inferior faculties of beings.

source: །དེ་ལ་སྐྱེ་བའི་ཁྱད་པར་ཤེས་པ་གང་ཞེ་ན།
en: “What is the knowledge of the various rebirths of beings?

source: འདི་ལྟ་སྟེ། འགྲོ་བ་ལྔ་རྣམ་པར་གཞག་པ་ཤེས་པའོ།
en: It is the knowledge of the different states of the five kinds of existence.

source: །དེ་ལ་ཡེ་ཤེས་མཐའ་ཡས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is knowledge of the infinite?

source: འཇིག་རྟེན་གྱི་དང་འཇིག་རྟེན་ལས་འདས་པའི་བཟོ་ལྷུན་གྱིས་གྲུབ་པ་ཤེས་པའོ།
en: It is the effortless knowledge of mundane and supramundane skills.

source: །དེ་ལ་ཚིག་གི་མཚམས་སྦྱར་བ་ཤེས་པ་གང་ཞེ་ན།
en: “What is the knowledge of the intended meaning of words?

source: འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག་ཤེས་པའོ།
en: It is the knowledge of the intended meaning of the Tathāgata’s words.

source: །དེ་ལ་ཁྱིམ་གྱི་གནས་ཡོངས་སུ་སྤངས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the rejection of living in a home?

source: ལུས་དང་སེམས་དབེན་ཞིང་མངོན་པར་བྱུང་བའོ།
en: It is leaving home for physical and mental solitude.

source: །དེ་ལ་ཁམས་གསུམ་ལ་མངོན་པར་མི་དགའ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is finding no joy in the three realms?

source: ཁམས་གསུམ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བའོ།
en: It is seeing the realms for what they truly are.

source: །དེ་ལ་སེམས་མ་གོད་པ་གང་ཞེ་ན།
en: “What is having a motivation that is not discouraged?

source: འདི་ལྟ་སྟེ། སེམས་ཡོངས་སུ་མི་གཏོང་བ་དང་། མཉམ་པར་བཞག་པ་ཡོངས་སུ་མི་གཏོང་བའོ།
en: It is not giving up the motivation and not giving up meditation.

source: །དེ་ལ་ཆོས་རྣམས་ལ་མངོན་པར་མ་ཆགས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is having no attachment to phenomena?

source: སྡུག་པ་ཐམས་ཅད་སྤོང་བའོ།
en: It is the renunciation of all that one has affection for.

source: །དེ་ལ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is having possession of the sacred Dharma?

source: སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཡོངས་སུ་སྲུང་བ་དང་། མདོ་སྡེ་འདི་ལྟ་བུ་འཛིན་པའོ།
en: It is preserving the Buddha’s enlightenment, and possessing sūtras such as this.

source: །དེ་ལ་ཆོས་སྲུང་བ་གང་ཞེ་ན།
en: “What is protecting the Dharma?

source: འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་ལ་སྨོད་པ་རྣམས་ཆོས་དང་འཐུན་པས་ཚར་གཅོད་པའོ།
en: It is subjugating, in a way that is in accord with the Dharma, those who malign the Buddha’s Dharma.

source: །དེ་ལ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡིད་ཆེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is conviction in the ripening of karma?

source: ཁྲེལ་ཡོད་པས་སྡིག་པའི་ལས་རྣམས་སྤོང་བ་དང་། དགེ་བའི་ཆོས་རྣམས་ཡོངས་སུ་བཙལ་བ་ལ་མངོན་པར་བརྩོན་པའོ།
en: It is forsaking bad actions through a sense of shame, and dedicating oneself to seeking good qualities.

source: །དེ་ལ་འདུལ་བ་ལ་མཁས་པ་གང་ཞེ་ན།
en: “What is skill in the vinaya?

source: འདི་ལྟ་སྟེ། རང་བཞིན་གྱིས་ལྟུང་བ་དང་། ལྟུང་བ་མ་ཡིན་པ་ཤེས་པ་དང་། བཅས་པའི་ལྟུང་བ་དང་། ལྟུང་བ་མ་ཡིན་པ་ཤེས་པའོ།
en: It is the knowledge of what are natural transgressions and what are not natural transgressions, and the knowledge of what are proscribed transgressions and what are not proscribed transgressions.

source: །དེ་ལ་རྩོད་པ་རྣམ་པར་ཞི་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the pacification of disputes?

source: འདུས་པ་རྣམ་པར་སྤངས་པའོ།
en: It is the avoidance of gatherings.

source: །དེ་ལ་འཐབ་པ་མེད་པ་དང་། རྩོད་པ་མེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the absence of discord and the absence of quarrels?

source: འཇིག་རྟེན་པའི་གཏམ་མི་འདོད་པའོ།
en: It is the absence of desire for worldly conversation.

source: །དེ་ལ་བཟོད་པའི་ས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is having reached the level of patience?

source: ལུས་དང་སེམས་ལ་གནོད་པ་བཟོད་པར་བྱེད་པའོ།
en: It is enduring harm to the body and mind.

source: །དེ་ལ་བཟོད་པ་ཡང་དག་པར་འཛིན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is maintaining patience?

source: ཕ་རོལ་གྱིས་ངན་དུ་སྨྲས་པ་དང་། ངན་དུ་བརྗོད་པའི་ཚིག་གི་ལམ་རྣམས་བཏང་སྙོམས་སུ་འཇོག་ཅིང་བཟོད་པ་མི་འདྲལ་བའོ།
en: It is maintaining equanimity and not losing one’s patience when others speak badly, saying unpleasant words.

source: །དེ་ལ་ཆོས་རབ་ཏུ་འབྱེད་པ་གང་ཞེ་ན།
en: “What is skill in examining phenomena?

source: འདི་ལྟ་སྟེ། ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་རྣམས་རབ་ཏུ་དབྱེ་བ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བའི་ཕྱོགས་རབ་ཏུ་དབྱེ་བ་དང་། དེ་དག་མི་དམིགས་པའོ།
en: It is distinguishing the skandhas, dhātus, and āyatanas, distinguishing the aspects of kleśas and purification, and not objectifying them.

source: །དེ་ལ་རྣམ་པར་གཏན་ལ་དབབ་པ་ལ་མཁས་པ་གང་ཞེ་ན།
en: “What is skill in gaining certainty concerning phenomena?

source: འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་བརྗོད་དུ་མེད་པའོ།
en: It is the inexpressibility of all phenomena.

source: །དེ་ལ་རབ་ཏུ་དབྱེ་བ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་རྣམ་པར་གཞག་པ་གང་ལ་ངེས་པར་རྟོག་པའོ།
en: “What is the knowledge of distinguishing between the words for phenomena? It is the accomplishment of the differentiation of all phenomena.

source: །དེ་ལ་ཆོས་ཀྱི་ཚིག་བསྒྲུབ་པ་ལ་མཁས་པའི་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྟོན་པའོ།
en: “What is skill in the presentation of the words for phenomena? It is teaching phenomena exactly as they are.

source: །དེ་ལ་དོན་དང་དོན་མ་ཡིན་པ་འདྲེས་པ་བསྒྲུབ་པ་ལ་མཁས་པ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་རྣམས་རང་བཞིན་གྱིས་བླང་བ་དང་། གཞག་པ་མེད་པའོ།
en: “What is the knowledge of the skill of presenting the distinction between words that have meaning and words that do not have meaning? It is that the nature of phenomena cannot be taken away from or added to.

source: །དེ་ལ་སྔོན་གྱི་མཐའ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is knowledge of the past?

source: རྒྱུ་ཤེས་པའོ།
en: It is the knowledge of causes.

source: །དེ་ལ་ཕྱི་མའི་མཐའ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is knowledge of the future?

source: རྐྱེན་ཤེས་པའོ།
en: It is the knowledge of contributing factors.

source: །དེ་ལ་དུས་གསུམ་མཉམ་པ་ཉིད་གང་ཞེ་ན།
en: “What is the knowledge of the equality of the three times?

source: འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ལ་ཐ་དད་དུ་བྱ་བ་མེད་པའི་དངོས་པོའི་ལུགས་ཀྱི་ཆོས་ཉིད་དོ།
en: It is the true nature of the way of things, which is that there is no differentiation to be made between all phenomena.

source: །དེ་ལ་འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the knowledge of the purity of the three aspects of actions?

source: འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་ཆོས་རྣམས་མི་དམིགས་ཤིང་ཡིད་ལ་མི་བྱེད་པའོ། །དེ་ལ་སེམས་གནས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་མི་དམིགས་པའོ།
en: It is not objectifying and having no mental engagement with phenomena of the past, future, or present.

source: །དེ་ལ་ལུས་རྣམ་པར་གཞག་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལུས་ལ་ཞུགས་པའི་རྗེས་སུ་དྲན་པའོ།
en: “What is the knowledge of the body’s condition? It is mindfulness of the body. “What is the knowledge of the mind’s condition? It is not objectifying the mind.

source: །དེ་ལ་སྤྱོད་ལམ་སྲུང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is guarding conduct?

source: གང་འདི་བསླད་པ་མེད་པའོ།
en: It is conduct that is unsullied.

source: །དེ་ལ་སྤྱོད་ལམ་མི་འཁྲུགས་པ་གང་ཞེ་ན།
en: “What is having unshakable conduct? It is conduct without error.

source: འདི་ལྟ་སྟེ། དགེ་བ་མི་སྤྱོམས་པའོ། །དེ་ལ་སྤྱོད་ལམ་རྣམ་པར་མི་རྟོག་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྡིག་པ་འདོད་པ་དང་བྲལ་བའོ།
en: “What is uncontrived conduct? It is being free of the desire for bad actions.

source: །དེ་ལ་དབང་པོ་དང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ལ་ཞུགས་པའི་ཡིད་ལ་བྱེད་པ་དང་། རིགས་པར་སྨྲ་བ་དང་། དུས་ཤེས་པ་དང་། ཡང་དག་པ་ཇི་ལྟ་བའི་ཆོས་རྣམས་ཡང་དག་པར་རབ་ཏུ་སྟོན་པའོ།
en: “What is having attractive conduct? It is the mind being focused upon engagement with the Dharma, speaking rationally, being aware of time, and teaching the Dharma correctly.

source: །དེ་ལ་འཇིག་རྟེན་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is knowledge of the world?

source: ཕར་འགྲོ་བ་དང་། ཕྱིར་འོང་བ་རབ་ཏུ་ཤེས་པའོ།
en: It is the knowledge of going and coming.

source: །དེ་ལ་ལྷུག་པར་གཏོང་བ་གང་ཞེ་ན།
en: “What is unrestrained generosity?

source: འདི་ལྟ་སྟེ། དངོས་པོ་རྣམས་མི་སྦེད་པ་དང་། སེར་སྣ་མེད་པའོ།
en: It is not holding on to things and being without miserliness.

source: །དེ་ལ་ལག་བརྐྱང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འགེད་པའི་ངང་ཚུལ་ཅན་ནོ།
en: “What is being openhanded? It is having a virtuous nature.

source: །དེ་ལ་སེམས་འཛིན་པ་མེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is having a mind without fixation?

source: དད་པ་རྙོག་པ་མེད་པའོ།
en: It is having unsullied faith.

source: །དེ་ལ་ཁྲེལ་ཡོད་པ་གང་ཞེ་ན།
en: “What is having a sense of self-respect?

source: འདི་ལྟ་སྟེ། མུ་ཅོར་མི་སྨྲ་བའོ།
en: It is not being talkative.

source: །དེ་ལ་ངོ་ཚ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is having a sense of modesty?

source: མངོན་དུ་གྱུར་པའོ།
en: It is that which is not evident to others.

source: །དེ་ལ་མི་དགེ་བའི་སེམས་སྨད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is an abhorrence of negative aspirations?

source: བྱིས་པའི་ཆོས་རྟོགས་པ་དང་། དེ་དག་དང་མི་འགྲོགས་པའོ།
en: It is understanding what are the qualities of foolishness, and not associating with them.

source: །དེ་ལ་སྦྱངས་པ་མི་གཏོང་བ་གང་ཞེ་ན།
en: “What is not forsaking the qualities of purification?

source: འདི་ལྟ་སྟེ། ཡི་དམ་ལ་བརྟན་པའོ།
en: It is being stable in commitments.

source: །དེ་ལ་སྤྱོད་པ་ཡང་དག་པར་འཛིན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is maintaining correct conduct?

source: སྤྱོད་པ་ལ་བརྟུལ་བ་བསྐྱེད་པའོ།
en: It is developing disciplined conduct.

source: །དེ་ལ་དགའ་བ་ཡང་དག་པར་སྤྱོད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is joyful conduct?

source: དགེ་བའི་ལས་ཀྱི་ཕན་ཡོན་ལ་སེམས་པའོ།
en: It is the contemplation of virtuous qualities.

source: །དེ་ལ་བླ་མ་དག་གི་སྟན་འདིང་ཞིང་ལྡང་བ་གང་ཞེ་ན།
en: “What is standing up to welcome gurus and presenting them with a seat?

source: འདི་ལྟ་སྟེ། ང་རྒྱལ་བཅོམ་ཞིང་སྙོམ་ལས་མེད་པའོ།
en: It is overcoming pride and not being lazy.

source: །དེ་ལ་ང་རྒྱལ་ཚར་གཅོད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the elimination of pride?

source: བདག་ཉིད་རྗེས་སུ་མི་དམིགས་ཤིང་རྩོམ་པ་མེད་པའོ།
en: It is not objectifying or depending upon a self.

source: །དེ་ལ་སེམས་རབ་ཏུ་གཟུང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is controlling the mind?

source: དཀར་པོའི་ཆོས་ཆུད་མི་ཟ་བར་ཤེས་པའོ།
en: It is the knowledge of how not to lose good qualities.

source: །དེ་ལ་སེམས་སྤྲོ་བར་བྱ་བ་གང་ཞེ་ན།
en: “What is the knowledge of generating enthusiasm?

source: འདི་ལྟ་སྟེ། བརྩོན་འགྲུས་ཆུད་མི་ཟ་བར་ཤེས་པའོ།
en: It is the knowledge of how not to lose the results of diligence.

source: །དེ་ལ་དོན་སོ་སོ་ཡང་དག་པར་རིག་པའི་ཤེས་པ་གང་ཞེ་ན།
en: “What is the knowledge of discernment?
